// 1. Створіть дві змінні для зберігання значень двох текстових полів.
// Перевірте, чи обидві змінні не є порожніми.
// Якщо обидва поля заповнені, вивести повідомлення
// "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".



// const textInput1 = "name"
// const textInput2 = "names"

// console.log(
//     (textInput1 && textInput2 !== false && textInput2 && textInput1 !== false) 
//         ? "Обидва поля заповнені" 
//          :"Не всі поля заповнені"
// );


// 2. Створіть дві змінні для зберігання числових значень.
// Обчисліть їх суму. Якщо сума більше 10 — виведіть
// "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

// const num1 = "14"
// const num2 = "7"

// if(dob > 10){
//     console.log("Сума більша за 10");
    
// }
// else{
//     console.log("Сума менша або дорівнює 10");
    
// }


// 3. Створіть змінну для зберігання тексту.
// Перевірте, чи містить цей текст слово "JavaScript".
// Якщо містить, виведіть "Текст містить слово JavaScript",
// якщо ні — "Текст не містить слово JavaScript".

// const textVar = "JavaScript"
// const message1 = textVar.includes("JavaScript") ? "Текст містить слово JavaScript" : "Текст не містить слово JavaScript";

// 5. Створіть змінні для зберігання значень полів (ім'я, email, пароль).
// Перевірте, чи ім'я містить не менше 3 символів, чи email містить символ @ та крапку після нього,
// а пароль не менше 6 символів. Якщо всі умови виконані —
// виведіть "Перенаправлення на іншу сторінку", якщо ні —
// "Помилка: неправильне заповнення".

// const nameVar = "nazar";
// const emailVar = "podobivskijnazar@gmail.com"
// const passwordVar = "nazar201010"

// if (
//     nameVar.length >= 3 &&
//     emailVar.includes("@") &&
//     emailVar.lastIndexOf(".") > emailVar.indexOf("@") &&
//     passwordVar.length >= 6
// ) {
//     console.log("Перенаправлення на іншу сторінку");
// } else {
//     console.log("Помилка: неправильне заповнення");
// }







